first_routes_controllers/app/controllers/artwork_shares_controller.rb

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def destroy
        share = Artwork.find(params[:id])