first_routes_controllers/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        render plain: 'This is an index'
        users = User.all

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "Megan"], ["created_at", "2021-04-01 18:42:27.178069"], ["updated_at", "2021-04-01 18:42:27.178069"]]
---
    def create
        user = User.new(user_params)
        return render json: user if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "miche"], ["email", "MR@gmail.com"], ["updated_at", "2021-03-31 21:26:17.287533"], ["id", 2]]
---
    def update
        user = User.find(params[:id])
        return redirect_to user_url if user.update(user_params)